hybridMultiphaseFoamV7/tutorials/Free_Flow_Cases/Flat_Plate_Contact_Angle/standard_Boundary/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue eps 0.999
    volScalarFieldValue alpha.wetting 0
);

regions
(

     boxToCell
    {
        box (0.25 0.0 0) (0.35 0.08 0.1);
        fieldValues
        (
            volScalarFieldValue alpha.wetting 1
        );
    }

);


// ************************************************************************* //
